towards-monads.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="english" xml:lang="english">
<head>
<!-- 2024-09-15 Sun 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Towards monads</title>
<meta name="author" content="Justin Veilleux" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Towards monads
<br />
<span class="subtitle">(or yet another monad tutorial)</span>
</h1>
<p>
This page on the Haskell wiki is very good and looks like what I wanted to
write: <a href="https://wiki.haskell.org/All_About_Monads">https://wiki.haskell.org/All_About_Monads</a>.
</p>

<p>
Monads are a very useful concept/design pattern in functional programming that
has unfortunately attained <i>meme status</i> partly because of the following phrase<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>:
</p>

<blockquote>
<p>
A monad is a monoid in the category of endofunctors, what's the problem?
</p>
</blockquote>

<p>
However, I propose that the usual way of explaining monads through metaphors is
bad. Monads are much easier the understand when viewed as the common abstraction over
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">List</span></code>, <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span></code>, <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Either</span></code>, <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">State</span> s</code>, <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">IO</span></code>,
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Writer</span> o</code> and <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Reader</span> o</code>.
</p>

<div id="outline-container-org0dcc36a" class="outline-2">
<h2 id="org0dcc36a"><span class="section-number-2">1.</span> <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span></code></h2>
<div class="outline-text-2" id="text-1">
<p>
The <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span></code> type is a good place to start. This is the type we use
when we realise we have a partial function (that might not be able to return
what it promised) and we want to signal that information in the type itself.
</p>

<p>
Here is an exemple of how we might use it:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">couldFailString</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">String</span>

<span style="color: #8f0075;">couldFailInt</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">Int</span>

<span style="color: #8f0075;">program</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> (<span style="color: #531ab6; font-weight: bold;">Int</span>, <span style="color: #531ab6; font-weight: bold;">String</span>)
<span style="color: #8f0075;">program</span> <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">case</span> couldFailString <span style="color: #005e8b; font-weight: bold;">of</span>
  <span style="color: #531ab6; font-weight: bold;">Nothing</span> <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Nothing</span>
  <span style="color: #531ab6; font-weight: bold;">Just</span> str <span style="color: #3548cf;">-&gt;</span> <span style="color: #005e8b; font-weight: bold;">let</span> strlen <span style="color: #3548cf;">=</span> length str <span style="color: #005e8b; font-weight: bold;">in</span>
    <span style="color: #005e8b; font-weight: bold;">case</span> couldFailInt <span style="color: #005e8b; font-weight: bold;">of</span>
      <span style="color: #531ab6; font-weight: bold;">Nothing</span> <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Nothing</span>
      <span style="color: #531ab6; font-weight: bold;">Just</span> int <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Just</span> (int, str)
</pre>
</div>


<p>
We achieved correctness! However, this is very annoying to write and to read.
The "look at the results, if we get nothing, return nothing but otherwise,
continue" pattern repeated <i>ad nauseum</i> hinders readibility. To the rescue:
monads! We know we have an <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Monad</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span></code> instance, so we can rely on
the two functions:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">bind</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Monad</span> m <span style="color: #3548cf;">=&gt;</span> m a <span style="color: #3548cf;">-&gt;</span> (a <span style="color: #3548cf;">-&gt;</span> m b) <span style="color: #3548cf;">-&gt;</span> m b
<span style="color: #8f0075;">return</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Monad</span> m <span style="color: #3548cf;">=&gt;</span> a <span style="color: #3548cf;">-&gt;</span> m a
</pre>
</div>

<p>
<code class="src src-haskell">return</code> is simple enough: it would wrap(for instance) an
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Int</span></code> into a <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">Int</span></code>. The signature of
<code class="src src-haskell">bind</code>, however is confusing. Let's make the signature more concrete:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">bindMaybe</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> a <span style="color: #3548cf;">-&gt;</span> (a <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> b) <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> b
</pre>
</div>

<p>
The <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span> a</code> part is the object we would pattern match on(the
results) and <code class="src src-haskell">a <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> b</code> is the "if we get something, continue"
part. Let's rewrite our program using these functions.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">couldFailString</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">String</span>

<span style="color: #8f0075;">couldFailInt</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">Int</span>

<span style="color: #8f0075;">program</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> (<span style="color: #531ab6; font-weight: bold;">Int</span>, <span style="color: #531ab6; font-weight: bold;">String</span>)
<span style="color: #8f0075;">program</span> <span style="color: #3548cf;">=</span> bindMaybe couldFailString
          (<span style="color: #3548cf;">\</span>str <span style="color: #3548cf;">-&gt;</span> <span style="color: #005e8b; font-weight: bold;">let</span> strlen <span style="color: #3548cf;">=</span> length str <span style="color: #005e8b; font-weight: bold;">in</span>
              bindMaybe couldFailInt
                (<span style="color: #3548cf;">\</span>int <span style="color: #3548cf;">-&gt;</span> <span style="color: #531ab6; font-weight: bold;">Just</span> (int, str)))
</pre>
</div>

<p>
This is more pleasing to the eye, but still slightly confusing. You could
imagine what happens to the nesting when we do many operations.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<p>
However, in Haskell, there is syntactic sugar for this kind of operation: <code>do</code>
notation. Let's change our code to use <code>do</code> notation:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">couldFailString</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">String</span>

<span style="color: #8f0075;">couldFailInt</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> <span style="color: #531ab6; font-weight: bold;">Int</span>

<span style="color: #8f0075;">program</span> <span style="color: #3548cf;">::</span> <span style="color: #531ab6; font-weight: bold;">Maybe</span> (<span style="color: #531ab6; font-weight: bold;">Int</span>, <span style="color: #531ab6; font-weight: bold;">String</span>)
<span style="color: #8f0075;">program</span> <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">do</span>
  str <span style="color: #3548cf;">&lt;-</span> bindMaybe couldFailString
  <span style="color: #005e8b; font-weight: bold;">let</span> strlen <span style="color: #3548cf;">=</span> length str
  int <span style="color: #3548cf;">&lt;-</span> couldFailInt
  <span style="color: #531ab6; font-weight: bold;">Just</span> (int, str)
</pre>
</div>

<p>
This <code>do</code> notation has exactly the same semantics(in terms of <code>bind</code>) as <code>await</code> (in
terms of <code>.then</code>) in Javascript. In other words,
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">program</span> <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">do</span>
  x <span style="color: #3548cf;">&lt;-</span> doSomething
  <span style="color: #3548cf;">...</span>
</pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8f0075;">program</span> <span style="color: #3548cf;">=</span> bind doSomething (<span style="color: #3548cf;">\</span>x <span style="color: #3548cf;">-&gt;</span> <span style="color: #3548cf;">...</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd63fca" class="outline-2">
<h2 id="orgbd63fca"><span class="section-number-2">2.</span> <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Either</span> e</code></h2>
<div class="outline-text-2" id="text-2">
<p>
Whereas <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span> a</code> means "potentially an <code class="src src-haskell">a</code>",
<code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Either</span> e a</code> means "potentially an <code class="src src-haskell">a</code>, or else an error
of type <code class="src src-haskell">e</code>".
</p>

<p>
If you know the <code>go</code> programming language, using do notation on <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Either</span> <span style="color: #531ab6; font-weight: bold;">SomeErrorType</span> x</code> is the same as doing
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #3548cf;">results</span>, <span style="color: #3548cf;">err</span> := <span style="color: #8f0075;">doSomething</span>()
<span style="color: #005e8b; font-weight: bold;">if</span> err != <span style="color: #531ab6;">nil</span> {
    <span style="color: #005e8b; font-weight: bold;">return</span> err
}
...
</pre>
</div>

<p>
The semantics is similar to <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Maybe</span></code>
</p>
</div>
</div>

<div id="outline-container-orgb5c99ff" class="outline-2">
<h2 id="orgb5c99ff"><span class="section-number-2">3.</span> <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">List</span></code></h2>
<div class="outline-text-2" id="text-3">
<p>
One might wonder why it would be useful to have <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">List</span></code> as a monad.
The answer is modelling nondeterminism in a functional way.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">:</span>{
<span style="color: #8f0075;">prog</span> <span style="color: #3548cf;">::</span> [(<span style="color: #531ab6; font-weight: bold;">Int</span>, <span style="color: #531ab6; font-weight: bold;">String</span>)]
<span style="color: #8f0075;">prog</span> <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">do</span> 
  int <span style="color: #3548cf;">&lt;-</span> [1, 2, 3, 4, 5]
  str <span style="color: #3548cf;">&lt;-</span> [<span style="color: #a0132f;">"one"</span>, <span style="color: #a0132f;">"two"</span>, <span style="color: #a0132f;">"three"</span>]
  <span style="color: #005e8b; font-weight: bold;">if</span> int <span style="color: #3548cf;">`mod`</span> 2 <span style="color: #3548cf;">==</span> 0
    <span style="color: #005e8b; font-weight: bold;">then</span> <span style="color: #531ab6; font-weight: bold;">[]</span>
    <span style="color: #005e8b; font-weight: bold;">else</span> return (int, str)
<span style="color: #531ab6; font-weight: bold;">:</span>}

prog
</pre>
</div>

<pre class="example">
[(1,"one"),(1,"two"),(1,"three"),(3,"one"),(3,"two"),(3,"three"),(5,"one"),(5,"two"),(5,"three")]
</pre>


<p>
Here, the <code>&lt;-</code> operation splits the universe into parallel branches. The end
result is a list of all the branches that got to the end. For instance, here is
how you might find Pythagorean triples:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">:</span>{
<span style="color: #8f0075;">n</span> <span style="color: #3548cf;">=</span> 40

<span style="color: #8f0075;">prog</span> <span style="color: #3548cf;">::</span> [(<span style="color: #531ab6; font-weight: bold;">Int</span>, <span style="color: #531ab6; font-weight: bold;">Int</span>, <span style="color: #531ab6; font-weight: bold;">Int</span>)]
<span style="color: #8f0075;">prog</span> <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">do</span>
  a <span style="color: #3548cf;">&lt;-</span> [1<span style="color: #3548cf;">..</span>n]
  b <span style="color: #3548cf;">&lt;-</span> [a<span style="color: #3548cf;">..</span>n]
  c <span style="color: #3548cf;">&lt;-</span> [b<span style="color: #3548cf;">..</span>n]
  <span style="color: #005e8b; font-weight: bold;">if</span> a<span style="color: #3548cf;">*</span>a <span style="color: #3548cf;">+</span> b<span style="color: #3548cf;">*</span>b <span style="color: #3548cf;">==</span> c<span style="color: #3548cf;">*</span>c
    <span style="color: #005e8b; font-weight: bold;">then</span> return (a, b, c)
    <span style="color: #005e8b; font-weight: bold;">else</span> <span style="color: #531ab6; font-weight: bold;">[]</span>
  <span style="color: #531ab6; font-weight: bold;">:</span>}

prog
</pre>
</div>

<pre class="example">
[(3,4,5),(5,12,13),(6,8,10),(7,24,25),(8,15,17),(9,12,15),(10,24,26),(12,16,20),(12,35,37),(15,20,25),(15,36,39),(16,30,34),(18,24,30),(20,21,29),(21,28,35),(24,32,40)]
</pre>
</div>
</div>

<div id="outline-container-orgf299bac" class="outline-2">
<h2 id="orgf299bac"><span class="section-number-2">4.</span> <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Writer</span></code></h2>
<div class="outline-text-2" id="text-4">
<p>
Let's say you want to do logging. In an imperative language, you would use
mutability and append to a log object (or even put prints everywhere). Here, you
can't do that. Instead, you accumulate a list of "entries" with each computation
you do.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #005e8b; font-weight: bold;">data</span> <span style="color: #531ab6; font-weight: bold;">Writer</span> o t <span style="color: #3548cf;">=</span> <span style="color: #531ab6; font-weight: bold;">Writer</span> (t, [o])

<span style="color: #8f0075;">wReturn</span> x <span style="color: #3548cf;">=</span> <span style="color: #531ab6; font-weight: bold;">Writer</span> (x, <span style="color: #531ab6; font-weight: bold;">[]</span>)
<span style="color: #531ab6; font-weight: bold;">Writer</span> (val, log) <span style="color: #3548cf;">&gt;&gt;=</span> f <span style="color: #3548cf;">=</span> <span style="color: #005e8b; font-weight: bold;">let</span> <span style="color: #531ab6; font-weight: bold;">Writer</span> (v2, log2) <span style="color: #3548cf;">=</span> f val
                          <span style="color: #005e8b; font-weight: bold;">in</span> <span style="color: #531ab6; font-weight: bold;">Writer</span> (v2, log <span style="color: #3548cf;">++</span> log2)


<span style="color: #531ab6; font-weight: bold;">Writer</span> (<span style="color: #a0132f;">"allo"</span>, <span style="color: #a0132f;">"truc"</span>) <span style="color: #3548cf;">&gt;&gt;=</span> <span style="color: #3548cf;">\</span>x <span style="color: #3548cf;">-&gt;</span> wReturn <span style="color: #3548cf;">$</span> x <span style="color: #3548cf;">++</span> <span style="color: #a0132f;">"truuuc"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org06b4d2b" class="outline-2">
<h2 id="org06b4d2b"><span class="section-number-2">5.</span> <code class="src src-haskell"><span style="color: #531ab6; font-weight: bold;">Reader</span></code></h2>
<div class="outline-text-2" id="text-5">
<p>
This time, you want to propagate "global variables" though your whole program,
but you can't actually mutate any global variables.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://james-iry.blogspot.com/2009/05/brief-incomplete-and-mostly-wrong.html">http://james-iry.blogspot.com/2009/05/brief-incomplete-and-mostly-wrong.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For those who use javascript Promises, <code class="src src-haskell">bind</code> is essentially
the same thing as <code class="src src-js">.then(x =&gt; ...)</code> for promises. If you know the solution
to the nesting problem, you won't be surprised by what comes next.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Justin Veilleux</p>
<p class="date">Created: 2024-09-15 Sun 21:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
